#============================================================================================        
#RANGE=========================================================================================
#============================================================================================
a = range(18) # 產生0~17連續數字
a = range(50, 55) # 產生50~54連續數字
a = range(0, 10, 2) # 產生0 2 4 6 8
a = range(5, 16, 5)
a = range(5, 0, -1) #包含起點、不包含終點
a = list(a)
print(a)

#輸出星號10個
for i in range(10):#i執行10次
    print('*', end='')#印出*號，結尾不換行

#輸入數字形成正方形(雙for in迴圈)
user = int( input('請輸入一個數字: ') )
for j in range(user):#ex:執行3次下面的迴圈，所以會有三行3*號
    for i in range(user):#ex:執行3次列印*號，不換行，所以每行會出現3個*號
        print('*', end='')
    print()
